import { Header } from "@/components/header";
import { Container, Stack, Typography } from "@mui/material";
import Image from "next/image";

export default function Service() {
  return (
    <Stack
      sx={{
        display: "flex",
        flexDirection: "column",
        py: "10px",
        gap: "35px",
      }}
      style={{ width: "100%" }}
    >
      <Container>
        <Header />
      </Container>
      <Stack flex={1} flexDirection="column" gap="40px">
        <Container>
          <Stack flex={1} flexDirection="row" gap="5px" alignItems="center">
            <Image
              src={"/Star 1.svg"}
              alt="star"
              width={24}
              height={24}
            ></Image>
            <Typography fontSize={22} fontWeight={700}>
              Үйлчилгээний нөхцөл
            </Typography>
          </Stack>
        </Container>
        <Container>
          <Typography fontSize={18} flex={1} align="justify" lineHeight="30px">
            Mstars Food delivery нь Mstars Lab компанийн интернэт худалдааны
            албан ёсны вэбсайт бөгөөд энэхүү нөхцөл, журам нь уг вэбсайтаар
            үйлчлүүлэх, худалдан авалт хийхтэй холбоотой үүсэх харилцааг
            зохицуулахад оршино. Энэхүү нөхцөл нь хэрэглэгч худалдан авалт хийх,
            вэбсайтаар үйлчлүүлэхээсээ өмнө хүлээн зөвшөөрч баталгаажуулсаны
            үндсэн дээр хэрэгжинэ. Энэхүү үйлчилгээний нөхцлийн хэрэгжилтэнд
            MStars Lab /цаашид байгууллага гэх/ болон хэрэглэгч /цаашид
            хэрэглэгч гэх/ хамтран хяналт тавина. Mstars Food delivery нь Mstars
            Lab компанийн интернэт худалдааны албан ёсны вэбсайт бөгөөд энэхүү
            нөхцөл, журам нь уг вэбсайтаар үйлчлүүлэх, худалдан авалт хийхтэй
            холбоотой үүсэх харилцааг зохицуулахад оршино. Энэхүү нөхцөл нь
            хэрэглэгч худалдан авалт хийх, вэбсайтаар үйлчлүүлэхээсээ өмнө
            хүлээн зөвшөөрч баталгаажуулсаны үндсэн дээр хэрэгжинэ. Энэхүү
            үйлчилгээний нөхцлийн хэрэгжилтэнд MStars Lab /цаашид байгууллага
            гэх/ болон хэрэглэгч /цаашид хэрэглэгч гэх/ хамтран хяналт тавина.
            Энэхүү нөхцөл нь хэрэглэгч худалдан авалт хийх, вэбсайтаар
            үйлчлүүлэхээсээ өмнө хүлээн зөвшөөрч баталгаажуулсаны үндсэн дээр
            хэрэгжинэ. Энэхүү үйлчилгээний нөхцлийн хэрэгжилтэнд MStars Lab
            /цаашид байгууллага гэх/ болон хэрэглэгч /цаашид хэрэглэгч гэх/
            хамтран хяналт тавина. Mstars Food delivery нь Mstars Lab компанийн
            интернэт худалдааны албан ёсны вэбсайт бөгөөд энэхүү нөхцөл, журам
            нь уг вэбсайтаар үйлчлүүлэх, худалдан авалт хийхтэй холбоотой үүсэх
            харилцааг зохицуулахад оршино. Энэхүү нөхцөл нь хэрэглэгч худалдан
            авалт хийх, вэбсайтаар үйлчлүүлэхээсээ өмнө хүлээн зөвшөөрч
            баталгаажуулсаны үндсэн дээр хэрэгжинэ. Энэхүү үйлчилгээний нөхцлийн
            хэрэгжилтэнд MStars Lab /цаашид байгууллага гэх/ болон хэрэглэгч
            /цаашид хэрэглэгч гэх/ хамтран хяналт тавина. Mstars Food delivery
            нь Mstars Lab компанийн интернэт худалдааны албан ёсны вэбсайт
            бөгөөд энэхүү нөхцөл, журам нь уг вэбсайтаар үйлчлүүлэх, худалдан
            авалт хийхтэй холбоотой үүсэх харилцааг зохицуулахад оршино. Энэхүү
            нөхцөл нь хэрэглэгч худалдан авалт хийх, вэбсайтаар үйлчлүүлэхээсээ
            өмнө хүлээн зөвшөөрч баталгаажуулсаны үндсэн дээр хэрэгжинэ. Энэхүү
            үйлчилгээний нөхцлийн хэрэгжилтэнд MStars Lab /цаашид байгууллага
            гэх/ болон хэрэглэгч /цаашид хэрэглэгч гэх/ хамтран хяналт тавина.
            Энэхүү нөхцөл нь хэрэглэгч худалдан авалт хийх, вэбсайтаар
            үйлчлүүлэхээсээ өмнө хүлээн зөвшөөрч баталгаажуулсаны үндсэн дээр
            хэрэгжинэ. Энэхүү үйлчилгээний нөхцлийн хэрэгжилтэнд MStars Lab
            /цаашид байгууллага гэх/ болон хэрэглэгч /цаашид хэрэглэгч гэх/
            хамтран хяналт тавина.
          </Typography>
        </Container>
      </Stack>
    </Stack>
  );
}
